#  1.创建demo01.py,创建单价变量unitPirce，赋值为100.23;输打印出"单价大于50,需要调整为原价90%，原价为:{unitPirce变量值}”（5）
#      2.创建单行注释，内容是"数据类型间转化"（5）
#      3.将字符串'12'转化为16进制数值并输出（5）
#      4.创建整型变量var,值为18,将var变量转化为字符串类型并输出（5）
#      5.创建字符串变量str,内容为50.45,将str值转化为浮点数并输出（5）
#      6.必须使用多行注释，第一行内容"复数及复数的运算"  第二行内容"复数的加减乘除"（5）
#      7.创建复数变量complex01,值为123.05-12.11j，使用属性打印complex01的实部和虚部（5）
#      8.创建复数变量complex02,值为15.05-15.89j，将complex01+complex02、complex01-complex02、complex01*complex02、complex01/complex02这4个结果输出出来（5）
#      9.创建一个多行的字符串str02，第一行内容为"这是一个段落， ",第二行内容为"可以由多行组成"，输出这个str02（5）
#      10.用运算符将str02内容重复3遍打印出来（5）
#      11.创建一个字符串str03,内容是"复数的表示方法 在Python中,复数可以使用实部和虚部表示。实部是一个实数,虚部是一个带有后缀j的实数。例如,3+4j就是一个复数,其中实部是3,虚部是4。",获取index为5的字符;获取index从3到8的内容;使用in或者not in判断"ABC"是不是在str03中（5分）
#      12.编写一个程序，要求用户输入一个月份，然后判断该月份属于哪个季节，并输出相应的季节名称。（5分）
#      13.编写一个程序，要求用户输入一个三角形的三条边长，然后判断它是等边三角形、等腰三角形、直角三角形还是普通三角形，并输出相应的结果（5分）
#      14.猜数字有些，随机1-10个数字，如果猜对输出正确，猜错输出错误。（5分）
#      15.写代码：计算 1 - 2 + 3 - 4 + ... + 99 中除了88以外所有数的总和？（5分）
# 16.斐波那契数列指的是这样一个数列 0, 1, 1, 2, 3, 5, 8, 13,特别指出：第0项是0，第1项是第一个1。从第三项开始，每一项都等于前两项之和（5分）
# 17.编写一个程序，要求用户输入一个字符串，然后判断该字符串中是否包含特定的子串，并输出相应的结果。（5分）
# 18.接收用户输入，判断是否纯数字。（5分）
# 19.给定一个字符串，找出其中不含有重复字符的最长子串的长度，例如“abcabcbb”输出3，最长无重复子串是：‘abc’。（5分）
#
# 20.编写一个程序，入职薪水10k,每年涨幅5%，50年后工资多少？（5分）



w