#01-第一个 python
print("my  python !")

# 03-变量格式化输出.py
# 数据类型:int |float| bool |str
#        整数  |浮点  |布尔  |字符串
#   变量没有类型| |数据有类型
a1=1    #整数
a2=0.1  #浮点
a3=type #布尔
a4="孙" #字符串
print(f" 整数：{a1} |浮点 ：{a2} |布尔 ：{a3} |字符串：{a4}")
print(" 整数： {}|浮点 ： {}|布尔 ：{} |字符串：{}".format(a1,a2,a3,a4))
print(" 字符串: %s||整数： %d|浮点 ： %2f"%(a4,a1,a2))
# 04-变量转换.py
s ="10"
print(type(s))#什么类型

# 05-变量运算.py


# 05-变量运算.py



# 06-分支语句.py


# 07-分支语句嵌套.py


# 08-课堂练习.py



# 09-循环while.py



# 10-循环for.py



# 11-for和else.py



# 12-高级变量_列表.py


# 13-高级变量_元组.py


# 14-高级变量_字典.py


# 15-高级变量_集合.py


# 16-可变数据类型和不可变数据类型.py


# 17-学生管理系统.py








